Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
#include "DataSpace.h"

#include <iostream>

#include "../utils/bitMacros.h"
#include "StreamUtils.h"
#include "DataUtils.h"

#include "../ATmega32u4.h"
#include "../extras/Debugger.h"

#define LU_MODULE "DataSpace"

void A32u4::DataSpace::doTick() {
	if (isBitSetNB(data[DataSpace::Consts::PRR0], 5)) {
		return;
	}
	uint8_t timer0 = data[DataSpace::Consts::TCNT0];
	timer0++;
	data[DataSpace::Consts::TCNT0] = timer0;
	if (timer0 == 0) {
		data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
		//printf("OVERFLOW at %llu\n", mcu->cpu.totalCycls);
	}

	markTimer0Update();
}
void A32u4::DataSpace::doTicks(uint8_t num) {
	if (isBitSetNB(data[DataSpace::Consts::PRR0], 5)) {
		return;
	}

	const uint8_t timer0 = data[DataSpace::Consts::TCNT0];
	const uint8_t timer0plus = timer0 + num;
	if (timer0plus < timer0) {
		mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
		//printf("OVERFLOW at %llu\n", mcu->cpu.totalCycls);
	}

	markTimer0Update();
}

void A32u4::DataSpace::checkForIntr() {
	if (data[A32u4::DataSpace::Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)) {
		//std::cout << mcu->cpu.totalCycls << std::endl;
		if (data[DataSpace::Consts::TIMSK0] & (1 << DataSpace::Consts::TIMSK0_TOIE0)) {
			if (sreg[DataSpace::Consts::SREG_I]) {
				//mcu->cpu.queueInterrupt(23); // 0x2E timer0 overflow interrupt vector
				data[A32u4::DataSpace::Consts::TIFR0] &= ~(1 << DataSpace::Consts::TIFR0_TOV0);
				mcu->cpu.directExecuteInterrupt(23);
				//printf("int at %llu\n", mcu->cpu.totalCycls);
			}
		}
	}
}
uint8_t A32u4::DataSpace::getTimer0Presc() const {
	return mcu->dataspace.data[DataSpace::Consts::TCCR0B] & 0b111;
}
uint16_t A32u4::DataSpace::getTimer0PrescDiv() const {
	return DataSpace::timerPresc[getTimer0Presc()];
}
void A32u4::DataSpace::markTimer0Update() { 
	// functions is supposed to set lastTimer0Update to the exact technically correct value, even if we are already past that
	uint64_t diff = mcu->cpu.totalCycls - lastSet.Timer0Update;
	diff = (diff / getTimer0PrescDiv()) * getTimer0PrescDiv();
	lastSet.Timer0Update += diff;
}


void A32u4::DataSpace::LastSet::resetAll() {
	EECR_EEMPE = 0;
	PLLCSR_PLLE = 0;
	ADCSRA_ADSC = 0;
	Timer0Update = 0;
}

bool A32u4::DataSpace::LastSet::operator==(const LastSet& other) const{
#define _CMP_(x) (x==other.x)
	return _CMP_(EECR_EEMPE) && _CMP_(PLLCSR_PLLE) && _CMP_(ADCSRA_ADSC) && _CMP_(Timer0Update);
#undef _CMP_
}

size_t A32u4::DataSpace::LastSet::sizeBytes() const {
	size_t sum = 0;
	sum += sizeof(EECR_EEMPE);
	sum += sizeof(PLLCSR_PLLE);
	sum += sizeof(ADCSRA_ADSC);
	sum += sizeof(Timer0Update);
	return sum;
}
uint32_t A32u4::DataSpace::LastSet::hash() const noexcept{
	size_t h = 0;
	DU_HASHC(h,EECR_EEMPE);
	DU_HASHC(h,PLLCSR_PLLE);
	DU_HASHC(h,ADCSRA_ADSC);
	DU_HASHC(h,Timer0Update);
	return h;
}



/*

DataSpace:

*/

A32u4::DataSpace::DataSpace(ATmega32u4* mcu) : mcu(mcu), 
#if MCU_USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size])
#endif
{
#if 1
	std::memset(data, 0, Consts::data_size);
	std::memset(eeprom, 0, Consts::eeprom_size);
#endif
}

A32u4::DataSpace::~DataSpace() {
#if MCU_USE_HEAP
	delete[] data;
	delete[] eeprom;
#endif
}

A32u4::DataSpace::DataSpace(const DataSpace& src): 
#if MCU_USE_HEAP
data(new uint8_t[Consts::data_size]), eeprom(new uint8_t[Consts::eeprom_size])
#endif
{
	operator=(src);
}
A32u4::DataSpace& A32u4::DataSpace::operator=(const DataSpace& src){
	std::memcpy(data, src.data, Consts::data_size);
	std::memcpy(eeprom, src.eeprom, Consts::eeprom_size);

	std::memcpy(sreg, src.sreg, 8);

	lastSet = src.lastSet;

	return *this;
}

void A32u4::DataSpace::reset() {
	resetIO();
	lastSet.resetAll();

	std::memset(sreg, 0, 8); // reset sreg cache
}
void A32u4::DataSpace::resetIO() {
	//add: set all IO Registers to initial Values
	for (size_t i = 0; i < Consts::io_size; i++) {
		data[Consts::io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::ext_io_size; i++) {
		data[Consts::ext_io_start + i] = 0;
	}
	for (size_t i = 0; i < Consts::eeprom_size; i++) {
		eeprom[i] = 0;
	}

	setSP(Consts::SP_initaddr);
}

MCU_INLINE uint8_t& A32u4::DataSpace::getGPRegRef(regind_t ind) {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return data[0], "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	return data[ind];
}
MCU_INLINE uint8_t A32u4::DataSpace::getGPReg(regind_t ind) const {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return 0, "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	return data[ind];
}
MCU_INLINE void A32u4::DataSpace::setGPReg(regind_t ind, reg_t val) {
	A32U4_ASSERT_INRANGE(ind, 0, Consts::GPRs_size, return, "General Purpouse Register Index out of bounds: %" PRIu8, ind);
	data[ind] = val;
}

MCU_INLINE uint8_t A32u4::DataSpace::getGPReg_(regind_t ind) const {
	return data[ind];
}
MCU_INLINE void A32u4::DataSpace::setGPReg_(regind_t ind, reg_t val) {
	data[ind] = val;
}

uint8_t A32u4::DataSpace::getByteAt(uint16_t addr) {
	A32U4_ASSERT_INRANGE2(addr, 0, Consts::data_size, return 0, "Data get Index out of bounds: " MCU_ADDR_FORMAT);

	if (addr >= Consts::GPRs_size && addr <= Consts::io_start + Consts::io_size + Consts::ext_io_size) { //only io needs updates
		update_Get(addr, true);
	}

#if MCU_RW_RECORD
	mcu->analytics.ramRead(addr);
#endif

	return data[addr];
}
void A32u4::DataSpace::setByteAt(uint16_t addr, uint8_t val) {
	A32U4_ASSERT_INRANGE2(addr, 0, Consts::data_size, return, "Data set Index out of bounds: " MCU_ADDR_FORMAT);

	uint8_t oldVal = data[addr];
	data[addr] = val;
	if (addr <= Consts::io_start + Consts::io_size + Consts::ext_io_size && addr >= Consts::GPRs_size) { //only io needs updates
		update_Set(addr, val, oldVal);
	}

#if MCU_RW_RECORD
	mcu->analytics.ramWrite(addr);
#endif
}
uint8_t A32u4::DataSpace::getIOAt(uint8_t ind) {
	return getByteAt(ind + Consts::io_start);
}
void A32u4::DataSpace::setIOAt(uint8_t ind, uint8_t val) {
	setByteAt(ind + Consts::io_start, val);
}

