Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
uint8_t A32u4::DataSpace::getRegBit(uint16_t id, uint8_t bit) {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::data_size, return 0, "getRegBit Index out of bounds: " MCU_ADDR_FORMAT);

	return (getByteAt(id) & (1 << bit)) != 0;
}
void A32u4::DataSpace::setRegBit(uint16_t id, uint8_t bit, bool val) {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::data_size, return, "setRegBit Index out of bounds: " MCU_ADDR_FORMAT);

	uint8_t byte = getByteAt(id);
	if (val) {
		byte |= 1 << bit;
	}
	else {
		byte &= ~(1 << bit);
	}
	setByteAt(id, byte);
}

MCU_INLINE uint16_t A32u4::DataSpace::getWordReg(uint8_t id) const {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::GPRs_size-1, return 0, "getWordReg Index out of bounds: " MCU_ADDR_FORMAT);
	return ((uint16_t)data[id + 1] << 8) | data[id];
}
MCU_INLINE void A32u4::DataSpace::setWordReg(uint8_t id, uint16_t val) {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::GPRs_size-1, return, "setWordReg Index out of bounds: " MCU_ADDR_FORMAT);
	data[id + 1] = val >> 8;
	data[id] = (uint8_t)val;
}
MCU_INLINE uint16_t A32u4::DataSpace::getWordRegRam(uint16_t id) const {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::data_size-1, return 0, "getWordRegRam Index out of bounds: " MCU_ADDR_FORMAT);
	return ((uint16_t)data[id + 1] << 8) | data[id];
}
MCU_INLINE void A32u4::DataSpace::setWordRegRam(uint16_t id, uint16_t val) {
	A32U4_ASSERT_INRANGE2(id, 0, Consts::data_size-1, return, "setWordRegRam Index out of bounds: " MCU_ADDR_FORMAT);
	data[id + 1] = val >> 8;
	data[id] = (uint8_t)val;
}

MCU_INLINE uint16_t A32u4::DataSpace::getX() const {
	return ((uint16_t)data[0x1b] << 8) | data[0x1a];
}
MCU_INLINE uint16_t A32u4::DataSpace::getY() const {
	return ((uint16_t)data[0x1d] << 8) | data[0x1c];
}
MCU_INLINE uint16_t A32u4::DataSpace::getZ() const {
	return ((uint16_t)data[0x1f] << 8) | data[0x1e];
}
MCU_INLINE void A32u4::DataSpace::setX(uint16_t word) {
	data[0x1b] = (word & 0xFF00) >> 8;
	data[0x1a] = word & 0xFF;
}
MCU_INLINE void A32u4::DataSpace::setY(uint16_t word) {
	data[0x1d] = (word & 0xFF00) >> 8;
	data[0x1c] = word & 0xFF;
}
MCU_INLINE void A32u4::DataSpace::setZ(uint16_t word) {
	data[0x1f] = (word & 0xFF00) >> 8;
	data[0x1e] = word & 0xFF;
}

uint32_t A32u4::DataSpace::getExtendedZ() {
	return ((uint32_t)data[Consts::RAMPZ] << 16) | getZ();
}

void A32u4::DataSpace::setSP(uint16_t val) {
	setWordRegRam(Consts::SPL, val);
#if MCU_INCLUDE_EXTRAS
	if(mcu->analytics.maxSP > val)
		mcu->analytics.maxSP = val;
#endif
}

void A32u4::DataSpace::update_Get(uint16_t Addr, bool onlyOne) {
	switch (Addr) {
		case 0xFFFF: //case for updating everything
		case Consts::EECR: {
			if ((data[Consts::EECR] & (1 << Consts::EECR_EEMPE)) && mcu->cpu.totalCycls - lastSet.EECR_EEMPE > 4) { // check if EE;PE is set but shouldnt
				data[Consts::EECR] &= ~(1 << Consts::EECR_EEMPE); //clear EEMPE
			}
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}

		case Consts::PLLCSR: {
			if ((data[Consts::PLLCSR] & (1 << Consts::PLLCSR_PLLE)) && !(data[Consts::PLLCSR] & (1 << Consts::PLLCSR_PLOCK)) && mcu->cpu.totalCycls - lastSet.PLLCSR_PLLE > PLLCSR_PLOCK_wait) { //if PLLE is 1 and PLOCK is 0 and enought time since PLLE set
				data[Consts::PLLCSR] |= (1 << Consts::PLLCSR_PLOCK); //set PLOCK
			}
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}

		case Consts::TCNT0: {
			data[Consts::TCNT0] += (uint8_t)((mcu->cpu.totalCycls - lastSet.Timer0Update) / DataSpace::timerPresc[getTimer0Presc()]);
			markTimer0Update();
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}

		case Consts::SREG: {
			uint8_t val = 0;
			val |= (sreg[Consts::SREG_C] != 0) << Consts::SREG_C;
			val |= (sreg[Consts::SREG_Z] != 0) << Consts::SREG_Z;
			val |= (sreg[Consts::SREG_N] != 0) << Consts::SREG_N;
			val |= (sreg[Consts::SREG_V] != 0) << Consts::SREG_V;
			val |= (sreg[Consts::SREG_S] != 0) << Consts::SREG_S;
			val |= (sreg[Consts::SREG_H] != 0) << Consts::SREG_H;
			val |= (sreg[Consts::SREG_T] != 0) << Consts::SREG_T;
			val |= (sreg[Consts::SREG_I] != 0) << Consts::SREG_I;
			data[Consts::SREG] = val;
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}
		
		case Consts::ADCSRA: {
			if (mcu->cpu.totalCycls >= lastSet.ADCSRA_ADSC + 0) { // clear bit if conversion is done
				data[Consts::ADCSRA] &= ~(1<<Consts::ADCSRA_ADSC);
			}
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}
		
		case Consts::ADCH: {
			//TODO: maybe unlock changing of ADC value
			if (mcu->cpu.totalCycls >= lastSet.ADCSRA_ADSC + 0) {
				if (!(data[Consts::ADCSRA] & (1 << Consts::ADMUX_ADLAR))) { // normal order => right adjusted
					data[Consts::ADCH] = getADCVal()>>8;
				}
				else { // left adjusted
					data[Consts::ADCH] = getADCVal()>>2;
				}
			}
			if (onlyOne) break;
			else DU_FALLTHROUGH;
		}
		case Consts::ADCL: {
			//TODO: maybe lock changing of ADC value
			if (mcu->cpu.totalCycls >= lastSet.ADCSRA_ADSC + 0) {
				if (!(data[Consts::ADCSRA] & (1 << Consts::ADMUX_ADLAR))) { // normal order => right adjusted
					data[Consts::ADCL] = (uint8_t)getADCVal();
				}
				else { // left adjusted
					data[Consts::ADCL] = getADCVal() << 6;
				}
			}
			if (onlyOne) break;
			//else DU_FALLTHROUGH;
		}
	}
}

void A32u4::DataSpace::update_Set(uint16_t Addr, uint8_t val, uint8_t oldVal) {
	switch (Addr) {
		case Consts::EECR:
			setEECR(val, oldVal);
			break;

		case Consts::PLLCSR:
			setPLLCSR(val, oldVal);
			break;

		case Consts::SPDR:
			setSPDR();
			break;

		case Consts::TCCR0B:
			setTCCR0B(val);
			break;

		case Consts::TIFR0:
			checkForIntr();
			break;

		case Consts::SREG:
			updateSREGCache();
			if((val & (1<<Consts::SREG_I)) && (data[Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)))
				mcu->cpu.breakOutOfOptim = true; // we need to break out of Optimisation to check if an interrupt can now occur (Global Interrupt Enable)
			break;

		case Consts::TCNT0:
			markTimer0Update();
			if (val < oldVal) {
				mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
				mcu->cpu.breakOutOfOptim = true;
			}
			//mcu->debugger.halt();
			break;

		case Consts::ADCSRA:
			if (oldVal & (1 << Consts::ADCSRA_ADSC) && !(val & (1 << Consts::ADCSRA_ADSC))) { // ADCSRA_ADSC has been set to 0
				data[Consts::ADCSRA] &= ~(1 << 1 << Consts::ADCSRA_ADSC); // clear again => should have no effect
			}
			if (!(oldVal & (1 << Consts::ADCSRA_ADSC)) && (val & (1 << Consts::ADCSRA_ADSC))) { // ADCSRA_ADSC has been set to 1 => start conversion
				if (val & (1 << Consts::ADCSRA_ADEN)) { // check if adc is enabled
					lastSet.ADCSRA_ADSC = mcu->cpu.totalCycls;
				}
			}
			break;
	}
}

void A32u4::DataSpace::updateSREGCache() {
	uint8_t val = data[Consts::SREG];
	for (uint8_t i = 0; i < 8; i++) {
		sreg[i] = val & (1 << i);
	}
}
void A32u4::DataSpace::updateCache() {
	updateSREGCache();
}


uint16_t A32u4::DataSpace::getADCVal() {
	return 0;
}


