Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
void A32u4::DataSpace::setEECR(uint8_t val, uint8_t oldVal){
	if (val & (1 << Consts::EECR_EERE)) {
		data[Consts::EEDR] = eeprom[getWordRegRam(Consts::EEARL)];
		val = val & ~(1 << Consts::EECR_EERE); //idk if this should be done bc its not stated anywhere but its the only logical thing
		mcu->cpu.totalCycls += 4;
	}

	if ((val & (1 << Consts::EECR_EEMPE)) && !(oldVal & (1 << Consts::EECR_EEMPE))) {
		lastSet.EECR_EEMPE = mcu->cpu.totalCycls;
	}

	if (val & (1 << Consts::EECR_EEPE)) {
		if (data[Consts::EECR] & (1 << Consts::EECR_EEMPE)) {
			uint8_t mode = data[Consts::EECR] >> 4;
			uint16_t Addr = getWordRegRam(Consts::EEARL);

			A32U4_ASSERT_INRANGE2(Addr, 0, Consts::eeprom_size, return, "Eeprom addr out of bounds" MCU_ADDR_FORMAT);

			switch (mode) {
			case 0b00:
				eeprom[Addr] = data[Consts::EEDR];
				break;
			case 0b01:
				eeprom[Addr] = 0;
				break;
			case 0b10:
				eeprom[Addr] |= data[Consts::EEDR]; //idk if it actually works like that
				break;
			}

			// set EEPE to 0 to indicate being ready again
			data[Consts::EECR] &= ~(1 << Consts::EECR_EEPE);
		}
	}
}
void A32u4::DataSpace::setPLLCSR(uint8_t val, uint8_t oldVal) {
	if (val & (1 << Consts::PLLCSR_PLLE)) {
		if (!(oldVal & (1 << Consts::PLLCSR_PLLE))) { //if PLLE is 0 but should be 1
			lastSet.PLLCSR_PLLE = mcu->cpu.totalCycls;
		}
	}
	else {
		if (oldVal & (1 << Consts::PLLCSR_PLLE)) { //if PLLE is 1 but should be 0
			data[Consts::PLLCSR] &= ~(1 << Consts::PLLCSR_PLOCK); //clear PLOCK
		}
	}
}
void A32u4::DataSpace::setSPDR() {
	if(SPI_Byte_Callback)
		SPI_Byte_Callback(data[Consts::SPDR]);

	for (uint8_t i = 0; i < 8; i++) {
		//Set SCK High
		//Set MOSI to REF_SPDR&0b1
		data[Consts::SPDR] >>= 1;
		if (SCK_Callback != NULL) {
			SCK_Callback();
		}
		//Set SCK LOW
	}
	data[Consts::SPSR] |= (1 << Consts::SPSR_SPIF);

	//request Interrupt if SPIE set
}
void A32u4::DataSpace::setTCCR0B(uint8_t val) {
	mcu->cpu.breakOutOfOptim = true;
	//printf("SWITCH to div:%d\n", timers.getTimer0PrescDiv());
	lastSet.Timer0Update = mcu->cpu.totalCycls; // dont use mark here since it shouldnt align with previous overflows (since this is the start and there are no previous overflows)
	//printf("fmark at %llu\n", mcu->cpu.totalCycls);
}

void A32u4::DataSpace::pushByteToStack(uint8_t val) {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP, Consts::ISRAM_start, Consts::data_size, return, "Stack pointer while push Byte out of bounds: " MCU_ADDR_FORMAT);
	data[SP] = val;
	setSP(SP - 1);

#if MCU_INCLUDE_EXTRAS
#if MCU_RW_RECORD
	mcu->analytics.ramWrite(SP);
#endif
#endif
}
uint8_t A32u4::DataSpace::popByteFromStack() {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP+1, Consts::ISRAM_start, Consts::data_size, return 0, "Stack pointer while pop Byte out of bounds: " MCU_ADDR_FORMAT);
	uint8_t Byte = data[SP + 1];

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerStackDec(SP + 1);

#if MCU_RW_RECORD
	mcu->analytics.ramRead(SP+1);
#endif
#endif

	setSP(SP + 1);

	return Byte;
}

void A32u4::DataSpace::pushAddrToStack(addrmcu_t Addr) {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP, Consts::ISRAM_start+1, Consts::data_size, return, "Stack pointer while push Addr out of bounds: " MCU_ADDR_FORMAT);
	data[SP] = (uint8_t)Addr; //maybe this should be SP-1 and SP-2
	data[SP - 1] = (uint8_t)(Addr >> 8);

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerAddressBytes(SP);

#if MCU_RW_RECORD
	mcu->analytics.ramWrite(SP);
	mcu->analytics.ramWrite(SP-1);
#endif
#endif

	setSP(SP - 2);
}
addrmcu_t A32u4::DataSpace::popAddrFromStack() {
	uint16_t SP = getWordRegRam(Consts::SPL);
	A32U4_ASSERT_INRANGE2(SP+1, Consts::ISRAM_start, Consts::data_size-1, return 0, "Stack pointer while pop Addr out of bounds: " MCU_ADDR_FORMAT);
	uint16_t Addr = data[SP + 2];//maybe this should be SP-1 and SP-2 
	Addr |= ((uint16_t)data[SP + 1]) << 8;

#if MCU_INCLUDE_EXTRAS
	mcu->debugger.registerStackDec(SP + 2);

#if MCU_RW_RECORD
	mcu->analytics.ramRead(SP + 2);
	mcu->analytics.ramRead(SP + 1);
#endif
#endif

	setSP(SP + 2);
	return Addr;
}

void A32u4::DataSpace::setSPIByteCallB(SPIByteCallB func) {
	SPI_Byte_Callback = func;
}
uint8_t* A32u4::DataSpace::getEEPROM() {
	return eeprom;
}
// get a pointer to the updated Dataspce Data arr (only gets updated on first call if cpu.totalcycles doesnt change)
const uint8_t* A32u4::DataSpace::getData() {
	static uint64_t lastCycs = 0;
	if (lastCycs != mcu->cpu.totalCycls) {
		lastCycs = mcu->cpu.totalCycls;
		update_Get(0xFFFF, false);
	}
	return data;
}
uint8_t A32u4::DataSpace::getDataByte(addrmcu_t Addr) {
	return getByteAt(Addr);
}

void A32u4::DataSpace::setDataByte(addrmcu_t Addr, uint8_t byte) {
	setByteAt(Addr, byte);
}

void A32u4::DataSpace::setBitTo(addrmcu_t Addr, uint8_t bit, bool val) {
	uint8_t byte = getData()[Addr];
	if (val)
		byte |= 1 << bit;
	else
		byte &= ~(1 << bit);
	setDataByte(Addr, byte);
}
void A32u4::DataSpace::setBitsTo(addrmcu_t Addr, uint8_t mask, uint8_t bits) {
	uint8_t byte = getData()[Addr];
	byte = (byte & ~mask) | bits;
	setDataByte(Addr, byte);
}

addrmcu_t A32u4::DataSpace::getSP() const {
	return getWordRegRam(Consts::SPL);
}

#define FAST_FLAGSET 1
#if 1
void A32u4::DataSpace::setFlags_NZ(uint8_t res) {
#if FAST_FLAGSET
	sreg[DataSpace::Consts::SREG_N] = res & 0b10000000;
	sreg[DataSpace::Consts::SREG_Z] = res == 0;
#else
	bool N = (res & 0b10000000) != 0;
	bool Z = res == 0;
	uint8_t val = 0;
	if (N) {
		val |= 1 << DataSpace::Consts::SREG_N;
	}
	if (Z) {
		val |= 1 << DataSpace::Consts::SREG_Z;
	}
	uint8_t& reg = getByteRefAtAddr(DataSpace::Consts::SREG);
	reg = (reg & 0b11111001) | val;
#endif
}
void A32u4::DataSpace::setFlags_NZ(uint16_t res) {
#if FAST_FLAGSET
	sreg[DataSpace::Consts::SREG_N] = res & 0b1000000000000000;
	sreg[DataSpace::Consts::SREG_Z] = res == 0;
#else
	bool N = (res & 0b1000000000000000) != 0;
	bool Z = res == 0;
	uint8_t val = 0;
	if (N) {
		val |= 1 << DataSpace::Consts::SREG_N;
	}
	if (Z) {
		val |= 1 << DataSpace::Consts::SREG_Z;
	}
	uint8_t& reg = getByteRefAtAddr(DataSpace::Consts::SREG);
	reg = (reg & 0b11111001) | val;
#endif
}

void A32u4::DataSpace::setFlags_HSVNZC_ADD(uint8_t a, uint8_t b, uint8_t c, uint8_t res) {
#if FAST_FLAGSET
	int8_t sum8 = (int8_t)a + (int8_t)b + c;
	int16_t sum16 = (int8_t)a + (int8_t)b + c;
	bool V;
	sreg[DataSpace::Consts::SREG_V] = V = sum8 != sum16;

	bool N;
	sreg[DataSpace::Consts::SREG_N] = N = (res & 0b10000000) != 0;

	sreg[DataSpace::Consts::SREG_S] = N ^ V;

