Julianiolo/ATmega32u4_Emulator/src/components/DataSpace.cpp
void A32u4::DataSpace::loadDataFromMemory(const uint8_t* data_, size_t len) {
	std::memcpy(data, data_, std::min((size_t)Consts::data_size, len));
	updateCache();
}

void A32u4::DataSpace::getState(std::ostream& output){
	update_Get(0xFFFF, false);

	getRamState(output);
	getEepromState(output);

	StreamUtils::write(output, lastSet.EECR_EEMPE);
	StreamUtils::write(output, lastSet.PLLCSR_PLLE);
	StreamUtils::write(output, lastSet.ADCSRA_ADSC);
	StreamUtils::write(output, lastSet.Timer0Update);
#if MCU_WRITE_HASH
	StreamUtils::write(output, hash());
#endif
}
void A32u4::DataSpace::setState(std::istream& input){
	setRamState(input);
	setEepromState(input);

	StreamUtils::read(input, &lastSet.EECR_EEMPE);
	StreamUtils::read(input, &lastSet.PLLCSR_PLLE);
	StreamUtils::read(input, &lastSet.ADCSRA_ADSC);
	StreamUtils::read(input, &lastSet.Timer0Update);
	A32U4_CHECK_HASH("DataSpace");
}

void A32u4::DataSpace::getRamState(std::ostream& output){
	output.write((const char*)data, Consts::data_size);
}
void A32u4::DataSpace::setRamState(std::istream& input){
	input.read((char*)data, Consts::data_size);
	updateCache();
}
void A32u4::DataSpace::getEepromState(std::ostream& output){
	output.write((const char*)eeprom, Consts::eeprom_size);
}
void A32u4::DataSpace::setEepromState(std::istream& input){
	input.read((char*)eeprom, Consts::eeprom_size);
}

bool A32u4::DataSpace::operator==(const DataSpace& other) const{
#define _CMP_(x) (x==other.x)
	return std::memcmp(data,other.data,Consts::data_size) == 0 &&
		std::memcmp(eeprom,other.eeprom,Consts::eeprom_size) == 0 &&
		std::equal(sreg,sreg+8,other.sreg,[](uint8_t a,uint8_t b){
			return (!!a) == (!!b);
		}) &&
		_CMP_(lastSet);
#undef _CMP_
}

size_t A32u4::DataSpace::sizeBytes() const {
	size_t sum = 0;

	sum += sizeof(mcu);

	sum += Consts::data_size;
	sum += Consts::eeprom_size;
#if MCU_USE_HEAP
	sum += sizeof(data);
	sum += sizeof(eeprom);
#endif

	sum += sizeof(SCK_Callback);
	sum += sizeof(SPI_Byte_Callback);

	sum += sizeof(sreg);

	sum += lastSet.sizeBytes();

	return sum;
}
uint32_t A32u4::DataSpace::hash() const noexcept{
	uint32_t h = 0;
	DU_HASHCB(h, data, Consts::data_size);
	DU_HASHCB(h, eeprom, Consts::eeprom_size);
	DU_HASHC(h,SCK_Callback);
	DU_HASHC(h,SPI_Byte_Callback);
	{
		uint8_t buf[sizeof(sreg)];
		for(size_t i = 0; i<sizeof(sreg); i++)
			buf[i] = !!sreg[i];
		DU_HASHCB(h, buf, sizeof(sreg));
	}
	DU_HASH_COMB(h, lastSet.hash());
	return h;
}


/*

#if 0
	switch (timer0Presc) {
	case 2:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 8;
		break;
	case 3:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 64;
		break;
	case 4:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 256;
		break;
	case 5:
		timers.lastCounter = (uint32_t)mcu->cpu.totalCycls / 1024;
		break;
	}
#endif


void A32u4::DataSpace::Timers::update() {
	abort();
#define USE_TIM0_CACHE 1

#if 1
#if USE_TIM0_CACHE
	if (getTimer0Presc() == 3) {
#else
	if ((mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) == 3) {
#endif
		goto fast_goto_64;
	}
#endif

	bool doTick;
#if USE_TIM0_CACHE
	switch (getTimer0Presc()) {
#else
	switch (mcu->dataspace.data[A32u4::DataSpace::Consts::TCCR0B] & 0b111) {
#endif
	case 0:
		doTick = false; break;
	case 1:
		doTick = true; break;
	case 2:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 8) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 8;
		break;
	case 3:
#if 1
		fast_goto_64:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 64) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 64;
#else
		{
			uint64_t val = mcu->cpu.totalCycls / 64;
			doTick = val != lastCounter;
			lastCounter = val;
		}
#endif
		break;
	case 4:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 256) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 256;
		break;
	case 5:
		doTick = ((uint32_t)mcu->cpu.totalCycls / 1024) != lastCounter;
		lastCounter = (uint32_t)mcu->cpu.totalCycls / 1024;
		break;
	default:
		abort();
	}

	//uint8_t& mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] = mcu->dataspace.getByteRefAtAddr(TIFR0);

	if (doTick) {
#if 1
		if (isBitSetNB(mcu->dataspace.data[DataSpace::Consts::PRR0], 5)) {
#else
		if (isBitSetNB(REF_PRR0, 5)) {
#endif
			return;
		}
		uint8_t& timer0 = mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TCNT0);
		timer0++;
		if (timer0 == 0) {	
			mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] |= (1 << DataSpace::Consts::TIFR0_TOV0); // set TOV0 in TIFR0
			goto direct_intr;
		}
	}

	if (mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] & (1 << DataSpace::Consts::TIFR0_TOV0)) {
		direct_intr:
		if (mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::TIMSK0) & (1 << DataSpace::Consts::TIMSK0_TOIE0)) {
			if (mcu->dataspace.getByteRefAtAddr(DataSpace::Consts::SREG) & (1 << DataSpace::Consts::SREG_I)) {
				//mcu->cpu.queueInterrupt(23); // 0x2E timer0 overflow interrupt vector
				mcu->dataspace.data[A32u4::DataSpace::Consts::TIFR0] &= ~(1 << DataSpace::Consts::TIFR0_TOV0);
				mcu->cpu.directExecuteInterrupt(23);
			}
		}
	}
}
}


constexpr uint8_t A32u4::DataSpace::getByteAtC(uint16_t addr) {
A32U4_ASSERT_INRANGE2_M(addr, 0, Consts::data_size, A32U4_ADDR_ERR_STR("Data get Index out of bounds: ",addr,4), "DataSpace", return 0);

update_GetC(addr, true);

return data[addr];
}


constexpr void A32u4::DataSpace::update_GetC(uint16_t Addr, bool onlyOne) {
if (Addr <= Consts::io_start + Consts::io_size + Consts::ext_io_size && Addr >= Consts::GPRs_size) { //only io needs updates
switch (Addr) {
case 0xFFFF: //case for updating everything
case Consts::EECR: {
if ((data[Consts::EECR] & (1 << Consts::EECR_EEMPE)) && mcu->cpu.totalCycls - lastEECR_EEMPE_set > 4) { // check if EE;PE is set but shouldnt
data[Consts::EECR] &= ~(1 << Consts::EECR_EEMPE); //clear EEMPE
}
if (onlyOne) break;
}

case Consts::PLLCSR: {
if ((data[Consts::PLLCSR] & (1 << Consts::PLLCSR_PLLE)) && !(data[Consts::PLLCSR] & (1 << Consts::PLLCSR_PLOCK)) && mcu->cpu.totalCycls - lastPLLCSR_PLLE_set > PLLCSR_PLOCK_wait) { //if PLLE is 1 and PLOCK is 0 and enought time since PLLE set
data[Consts::PLLCSR] |= (1 << Consts::PLLCSR_PLOCK); //set PLOCK
}
if (onlyOne) break;
}
}
}
}

*/